In [1]:
import pandas as pd

# Pandas Series

In [ ]:
airports = pd.Series(["Seattle-Tacoma", "Dulles", "London Heathrow", "Sciphol", "Changi", "Pearson", "Narita"])

In [4]:
airports

0     Seattle-Tacoma
1             Dulles
2    London Heathrow
3            Sciphol
4             Changi
5            Pearson
6             Narita
dtype: object

### Reference by index

In [6]:
airports[4]

'Changi'

### Loop through pandas Series

In [7]:
for item in airports:
    print(item)

Seattle-Tacoma
Dulles
London Heathrow
Sciphol
Changi
Pearson
Narita

# Pandas Data Frame

In [9]:
airports = pd.DataFrame([
    ["Seattle-Tacoma", "Seattle", "USA"],
    ["Dulles", "Washington", "USA"],
    ["London Heathrow", "London", "United Kingdom"],
    ["Sciphol", "Amsterdam", "Netherlands"],
    ["Changi", "Singapore", "Singapore"],
    ["Pearson", "Toronto", "Canada"],
    ["Narita", "Tokyo", "Japan"]
])

airports

                 0           1               2
0   Seattle-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London Heathrow      London  United Kingdom
3          Sciphol   Amsterdam     Netherlands
4           Changi   Singapore       Singapore
5          Pearson     Toronto          Canada
6           Narita       Tokyo           Japan

In [10]:
airports = pd.DataFrame([
    ["Seattle-Tacoma", "Seattle", "USA"],
    ["Dulles", "Washington", "USA"],
    ["London Heathrow", "London", "United Kingdom"],
    ["Sciphol", "Amsterdam", "Netherlands"],
    ["Changi", "Singapore", "Singapore"],
    ["Pearson", "Toronto", "Canada"],
    ["Narita", "Tokyo", "Japan"]
    ], columns = ["Name", "City", "Country"]
)

airports

              Name        City         Country
0   Seattle-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London Heathrow      London  United Kingdom
3          Sciphol   Amsterdam     Netherlands
4           Changi   Singapore       Singapore
5          Pearson     Toronto          Canada
6           Narita       Tokyo           Japan

In [14]:
temp = pd.DataFrame(
    {
        "BookName": ["Think Big", "Rich Dad", "Flip It"],
        "Author": ["Donald", "Robert", "Micheal"]
    }
)

temp

    BookName   Author
0  Think Big   Donald
1   Rich Dad   Robert
2    Flip It  Micheal

### Initial Check on data

In [15]:
airports.head(3)

              Name        City         Country
0   Seattle-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London Heathrow      London  United Kingdom

In [16]:
airports.tail(3)

      Name       City    Country
4   Changi  Singapore  Singapore
5  Pearson    Toronto     Canada
6   Narita      Tokyo      Japan

In [18]:
airports.shape

(7, 3)

In [19]:
airports.ndim

2

In [24]:
airports.size

21

In [22]:
airports.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     7 non-null      object
 1   City     7 non-null      object
 2   Country  7 non-null      object
dtypes: object(3)
memory usage: 296.0+ bytes

NOTE: **Strings are datatype object**